/*
 * @Author: 王荣文
 *  未经作者允许，禁止转载,All Rights Reserved.
 */
/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#ifndef __CONFIG_H
#define __CONFIG_H

/*********************************************************/

//#define MAIN_Fosc 22118400L //定义主时钟
//#define MAIN_Fosc 12000000L //定义主时钟
//#define MAIN_Fosc 11059200L //定义主时钟
//#define MAIN_Fosc		 5529600L	//定义主时钟
#define MAIN_Fosc 24000000L //定义主时钟
//#define MAIN_Fosc		33177600L	//定义主时钟

/*********************************************************/

#include "STC8xxxx.H"
// #include "STC_it.h"
#include "UART.h"
// #include "MAX31855.h"
// #include "CANSPI.h"
// #include "MCP2515.h"
#include "stdio.h"
// #include <math.h>
// #include <string.h>
//////////////////GPIO重命名//////////////////////////


//////////////////////延时函数(main.c里实现)//////////////////////

///////////////interrupt function///////////////////////////////////////////////
//SDCC 特有的，中断函数需要在主函数文件上声明
// void UART1_int(void) __interrupt(UART1_VECTOR);


#endif /*__CONFIG_H*/
